#include "includes.h"
#include<KF8A100GQS.h>
#include<Timer.h>

/****************************************************************************************
 * 函数名     ：Timer0_Init
 * 函数功能：8位定时器0初始化,每1us计时加1，1*250=250us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer0_Init(void)
{
	_CWDT();
	OPTR  = OPTR_Prescale_SEL_T0|OPTR_Prescale_DIV_16;		//	预分频器64M/4/16
	T0CTL = T0CLK_SEL_SCLK;									//	SCLK为时钟源
	T0 = 0;
	T0IF = 0;
	T0IE = 1;
}

/****************************************************************************************
 * 函数名     ：Timer1_Init
 * 函数功能：16位定时器1初始化,使用PP2 PP1，重载计数	0.5*500=250us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer1_Init(void)
{
	T1CTL2 = T1CLK_SEL_SCLK|T1CLK_Prescale_DIV_1;	//	64m/4/8
	T1H=0xF1;
	T1L=0xA9;
//	T1H=0x3C;
//	T1L=0x6A;
	T1CTL =0x01;
	T1IF =0;
	T1IE =1;
}

/****************************************************************************************
 * 函数名     ：Timer2_Init
 * 函数功能：16位定时器2初始化,T4与T2一致;T2使用PP60-1，T4使用PP61-1;重载计数	2.5*400=1000us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer2_Init(void)
{
	T2CTL0 = 0;	//	64m/16/10
	T2CTL1 = TIMER2_UP_UPOverflow|T2CLK_SEL_SCLK;
	T2H=0;
	T2L=0;
	PP60H=0x11;		//400-1
	PP60L=0x80-1;
	T2ON = 1;		//T2定时器启动
	T2IF = 0;
	T2IE = 1;
}

/****************************************************************************************
 * 函数名     ：Timer3_Init
 * 函数功能：16位定时器3初始化,T3与T7一致;T3使用T3RE-1，T7使用T7RE;重载计数	2.5*400=1000us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer3_Init(void)
{

	T3CTL = TIMER3_Reload_enable|T3CLK_SEL_SCLK|T3CLK_Prescale_DIV_8;	//	64m/8
	T3H=0;
	T3L=0;
	T3REH=0x07;		//2000-1
	T3REL=0xCF;
	T3ON = 1;		//T3定时器启动
	T3IF = 0;
	T3IE = 1;
}

/****************************************************************************************
 * 函数名     ：Timer5_Init
 * 函数功能：16位定时器5初始化,T5与T6一致;T5使用PP70-1，T6使用PP71-1;重载计数	2.5*400=1000us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer5_Init(void)
{
	T5CTL0 = T5CLK_Prescale1_DIV_16|T5CLK_Prescale2_DIV_10;	//	64m/16/10
	T5CTL1 = TIMER5_UP_UPOverflow|T5CLK_SEL_SCLK;
	T5H=0;
	T5L=0;
	PP70H=0x01;		//400-1
	PP70L=0x90-1;
	T5ON = 1;		//T5定时器启动
	T5IF = 0;
	T5IE = 1;
}

/****************************************************************************************
 * 函数名     ：Timer8_Init
 * 函数功能：16位定时器8初始化,T8与T9一致;T8使用PP3，T9使用PP4;重载计数	2.5*400=1000us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer8_Init(void)
{
	T8CTL  = T8CLK_Prescale1_DIV_16|T8CLK_Prescale2_DIV_10;	//	64m/16/10
	T8CTL1 = T8CLK_SEL_SCLK;
	T8H=0;
	T8L=0;
	PP3H=0x01;		//400-1
	PP3L=0x90-1;
	T8IF = 0;
	T8IE = 1;
	T8ON = 1;		//T8定时器启动
//	while(!T8IF)
//	_CWDT();
//	_NOP();_NOP();_NOP();
//	T8ON=0;
//	T8IF=0;
}

/****************************************************************************************
 * 函数名     ：Timer10_Init
 * 函数功能：16位定时器8初始化,T10使用PP5	重载计数	2.5*400=1000us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer10_Init(void)
{
	T10CTL0  = T10CLK_Prescale1_DIV_16|T10CLK_Prescale2_DIV_10|T10CLK_SEL_SCLK;	//	64m/16/10
	T10CTL1  = TIMER10_UP_UPOverflow;
	T10H=0;
	T10L=0;
	PP5H=0x01;		//400-1
	PP5L=0x90-1;
	T10ON = 1;		//T10定时器启动
	T10IF = 0;
	T10IE = 1;
}
